; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=3, packages=3, locations=6, max_capacity=2, out_folder=training/easy, instance_id=16, seed=57

(define (problem transport-16)
 (:domain transport)
 (:objects 
    v1 v2 v3 - vehicle
    p1 p2 p3 - package
    l1 l2 l3 l4 l5 l6 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l2)
    (at p2 l5)
    (at p3 l3)
    (at v1 l4)
    (at v2 l3)
    (at v3 l4)
    (road l2 l4)
    (road l1 l5)
    (road l4 l6)
    (road l5 l1)
    (road l4 l2)
    (road l6 l4)
    (road l5 l3)
    (road l2 l5)
    (road l3 l5)
    (road l5 l2)
    (road l1 l6)
    (road l6 l1)
    (road l1 l2)
    (road l2 l1)
    (road l1 l4)
    (road l4 l1)
    (road l1 l3)
    (road l3 l1)
    (road l5 l6)
    (road l6 l5)
    (road l2 l6)
    (road l6 l2)
    (road l3 l4)
    (road l4 l3)
    (road l2 l3)
    (road l3 l2)
    (road l4 l5)
    (road l5 l4)
    (road l3 l6)
    (road l6 l3)
    )
 (:goal  (and 
    (at p1 l4)
    (at p2 l2)
    (at p3 l5))))

; plan
1. (pick-up v2 l3 p3 c1 c2)
   deleted: (at p3 l3) (capacity v2 c2)
   added: (in p3 v2) (capacity v2 c1)
   goals met: 0 of 3
2. (drive v2 l3 l5)
   deleted: (at v2 l3)
   added: (at v2 l5)
   goals met: 0 of 3
3. (pick-up v2 l5 p2 c0 c1)
   deleted: (at p2 l5) (capacity v2 c1)
   added: (in p2 v2) (capacity v2 c0)
   goals met: 0 of 3
4. (drop v2 l5 p3 c0 c1)
   deleted: (in p3 v2) (capacity v2 c0)
   added: (at p3 l5) (capacity v2 c1)
   goals met: 1 of 3
5. (drive v2 l5 l2)
   deleted: (at v2 l5)
   added: (at v2 l2)
   goals met: 1 of 3
6. (pick-up v2 l2 p1 c0 c1)
   deleted: (at p1 l2) (capacity v2 c1)
   added: (in p1 v2) (capacity v2 c0)
   goals met: 1 of 3
7. (drop v2 l2 p2 c0 c1)
   deleted: (in p2 v2) (capacity v2 c0)
   added: (at p2 l2) (capacity v2 c1)
   goals met: 2 of 3
8. (drive v2 l2 l4)
   deleted: (at v2 l2)
   added: (at v2 l4)
   goals met: 2 of 3
9. (drop v2 l4 p1 c1 c2)
   deleted: (in p1 v2) (capacity v2 c1)
   added: (at p1 l4) (capacity v2 c2)
   goals met: 3 of 3
